Revit 2024 API
FabricationPart.AlignPartByConnector Method
 Align the part by its connector to a point and rotation in free space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static bool AlignPartByConnector(
	Document document,
	Connector connector,
	XYZ position,
	double rotation,
	double rotationPerpendicular,
	double slope,
	FabricationPartJustification justification,
	Transform trf
)
Visual Basic
Public Shared Function AlignPartByConnector ( _
	document As Document, _
	connector As Connector, _
	position As XYZ, _
	rotation As Double, _
	rotationPerpendicular As Double, _
	slope As Double, _
	justification As FabricationPartJustification, _
	trf As Transform _
) As Boolean
Visual C++
public:
static bool AlignPartByConnector(
	Document^ document,
	Connector^ connector,
	XYZ^ position,
	double rotation,
	double rotationPerpendicular,
	double slope,
	FabricationPartJustification justification,
	Transform^ trf
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
connector
Type: Autodesk.Revit.DB.Connector
 The connector to align in free space.
position
Type: Autodesk.Revit.DB.XYZ
 The position to move the connector to.
rotation
Type: System.Double
 The rotation in radians.
rotationPerpendicular
Type: System.Double
 The perpendicular rotation for free placement around the Y axis direction of connection - angle in radians.
slope
Type: System.Double
 The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied to fittings, whilst straights will inherit the slope from the piece it is connecting to.
justification
Type: Autodesk.Revit.DB.Fabrication.FabricationPartJustification
 The justification to align eccentric parts.
trf
Type: Autodesk.Revit.DB.Transform
 Optional alignment transformation matrix, eg. a Trf that describes plan or side elevation.
Return Value
 True if the alignment succeeds, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The connector does not belong to a fabrication part. -or- The fabrication part is connected.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace